---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalLoopType.Internal
enum: Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType.Internal

An internal loop is a loop that is inside another loop.
 In the case of multiple nested loops, this will return all loops except the most external loop.